Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.SetValueForHour(System.Int32,System.Double)
Sets the usage value for an hour.
hour:
The hour in the day, as an integer. For example: 0 is 12:00 midnight to 1:00 am, 6 is 6:00 am to 7:00 am, 12 is 12:00 noon to 1:00 pm, and 23 is 11:00 pm to midnight.
To avoid issues around daylight savings times, these hours represent 1/24 of an earth rotation, and will not be exactly 60 minutes.
usage:
The usage as a fraction between 0 and 1 inclusive. For example: 0 in a lighting schedule means all lights are off, .5 means half of lights are on, 1 means all lights are on.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
hour must be from 0 to 23 inclusive.
-or-
The given value for usage must be non-negative.
-or-
usage should be less than or equal to 1.
Since:
2025

Autodesk.Revit.DB.Analysis.BuildingOperatingDaySchedule.GetValueForHour(System.Int32)
Gets the usage value for an hour.
hour:
The hour in the day, as an integer. For example: 0 is 12:00 midnight to 1:00 am, 6 is 6:00 am to 7:00 am, 12 is 12:00 noon to 1:00 pm, and 23 is 11:00 pm to midnight.
To avoid issues around daylight savings times, these hours represent 1/24 of an earth rotation, and will not be exactly 60 minutes.
Returns:
The usage as a fraction between 0 and 1 inclusive. For example: 0 in a lighting schedule means all lights are off, .5 means half of lights are on, 1 means all lights are on.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
hour must be from 0 to 23 inclusive.
Since:
2025